## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.key_vault.azurerm_key_vault.this will be created
  + resource "azurerm_key_vault" "this" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + id                            = (known after apply)
      + location                      = "eastus2"
      + name                          = "demokv12345"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + rbac_authorization_enabled    = (known after apply)
      + resource_group_name           = "rg-terraform-dev2"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 14
      + tags                          = {
          + "environment" = "dev"
          + "owner"       = "platform-team"
        }
      + tenant_id                     = "4f06e6e8-ae4a-4b64-882a-792a2a921809"
      + vault_uri                     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>